Repository: 84000/data-translation-memory
Catalog: toh145-v4.tmx
Source language: bo
Languages: en

source: །གང་གི་གཟུགས་གང་གནས་གང་ཆ་བྱད་གང་།
en: “ ‘Whatever forms he assumes, whatever places and whatever costumes,

source: །དེ་དང་དེ་དག་དེ་ལྟར་ཆུ་ལས་མཐོང་།
en: Each and every one is seen within the water.

source: །འོན་ཀྱང་ཆུ་ལ་བྱམས་སྡང་རྣམ་རྟོག་མེད།
en: Yet in the water there is no notion of love and hate.

source: །རྒྱ་མཚོའི་ལྷ་མོ་སྒྲ་ལྡན་ཞེས་བྱ་བ།
en: “ ‘The goddess of the ocean named Hrādinī Who is expert in the ways of intoning the families of languages

source: །སེམས་ཅན་རྒྱ་མཚོར་ཇི་སྙེད་སྐྱེས་རྣམས་ཀྱི།
en: Of all the creatures born in the ocean

source: །སྒྲ་ཡི་ཡན་ལག་དབྱངས་ཀྱི་ཚུལ་མཁས་ཏེ། །རང་གི་སྐད་ཀྱིས་སྐད་ཀུན་ཚིམ་པར་བྱེད།
en: Is able to satisfy speakers of all languages with her own speech.

source: །སྒྲ་ལྡན་ཆགས་སྡང་གཏི་མུག་ཅན་དེ་ཡང་།
en: “ ‘If even this Hrādinī, who has attachment, anger, and delusion,

source: །སྐད་རྣམས་ཀུན་གྱི་སྒྲ་ཡི་ཚུལ་མཁས་ན།
en: Is expert in the ways of speaking in all those languages,

source: །གཟུངས་དང་ཆོས་ཀྱི་སྟོབས་ལ་དབང་ཐོབ་རྣམས།
en: Then why could those who have gained control over the dhāraṇīs and powers of the Dharma

source: །ལྷར་བཅས་འཇིག་རྟེན་ཅི་ཕྱིར་མགུ་མི་བྱེད།
en: Not gladden the world with its gods?

source: །ཏུམ་བུ་རུ་ཡི་ཆུང་མ་དབྱངས་ལྡན་མ།
en: “ ‘Tumburu’s wife Sarasvatī,

source: །ཚངས་པའི་བུ་མོ་ཡིད་ལས་བྱུང་བ་དེ།
en: That daughter of Brahmā sprung from his mind,

source: །བདེན་དང་དམ་བཅས་མི་འཚེ་དགའ་རྣམས་ཀྱི།
en: Who enters the minds of those who delight in truth and vow not to cause harm,

source: །སེམས་དང་ཡིད་དང་ཁ་ཡི་སྒོར་འཇུག་སྟེ།
en: And who influences the avenues of their thoughts and minds and mouths—

source: །དབྱངས་ལྡན་ཆགས་ཅན་ཞེ་སྡང་ཅན་དེ་ཡང་།
en: “ ‘If even that sweet-voiced goddess, desirous and angry,

source: །བརྟུལ་ཞུགས་གྲུབ་འཐུན་དབྱངས་ཀྱི་ཡན་ལག་གི། །ཡིད་འོང་སྐད་ཀྱིས་འཇིག་རྟེན་མགུ་བྱེད་ན།
en: Can please the world using her beautiful speech, Which is an element of voice in harmony with practiced austerities,

source: །ཡེ་ཤེས་ཡོན་ཏན་ཕྱུག་རྣམས་ཅིས་མི་བྱེད།
en: Why could those who are rich with the qualities of gnosis not do so?

source: །རིག་སྔགས་ཚུལ་མཁས་སྒྱུ་མའི་མཁན་པོ་ནི།
en: “ ‘A magician who is expert in spells

source: །སྣ་ཚོགས་གཟུགས་མང་མཐའ་ཡས་སྟོན་པར་བྱེད།
en: Can project many diverse forms without limit

source: །ཉིན་མཚན་ཡུད་དང་ཟླ་བ་ལོ་བརྒྱ་དང་། །ཁྱིམ་བཟང་རྒྱས་པ་ཤིན་ཏུ་མཛེས་པ་སྟོན།
en: And can show a day or night passing in a moment, or a month, or a hundred years And can project an extensive and lovely mansion.

source: །འདོད་ཆགས་སྡང་ལྡན་སྒྱུ་མའི་མཁན་པོ་ཡང་།
en: “ ‘If even the desirous and angry magician

source: །སྒྱུ་མའི་འཕྲུལ་གྱིས་འཇིག་རྟེན་མགུ་བྱེད་ན།
en: Can please the world through magical wonders,

source: །བསམ་གཏན་མངོན་ཤེས་རྣམ་ཐར་རབ་བསླབས་པ།
en: Then why would those who have mastered concentration, clairvoyance, and the emancipations,

source: །སྤྱོད་ཚུལ་མཁས་རྣམས་ཅི་ཕྱིར་མགུ་མི་བྱེད།
en: And who are expert in the modes of conduct, not be able to do so?

source: །ལྷ་དང་ལྷ་མིན་དབང་པོ་འཐབ་པའི་ཚེ།
en: “ ‘When the rulers of the gods and asuras fight,

source: །རྒྱལ་ལྡན་ལྷ་ཡིས་ལྷ་མིན་ཕམ་བྱས་ན།
en: If the victorious gods defeat the asuras,

source: །དེ་དག་འཇིགས་པས་གདུགས་བཅས་བཞིན་བཅས་ཤིང་།
en: The asuras run away in fear, taking with them their parasols,

source: །ཐེག་བཅས་དམག་བཅས་གོ་གྱོན་བཞིན་དུ་འབྱེར།
en: Mounts, and vehicles, with their army still clad in armor.

source: །འདོད་ཆགས་སྡང་ལྡན་ལྷ་དབང་དེ་དག་ཀྱང་།
en: “ ‘If even those gods filled with desire and hatred

source: །དབང་ཕྱུག་རྫུ་འཕྲུལ་དབང་གནས་དཔའ་བོ་རྣམས།
en: Then why could those heroes who dwell in the might of powerful magic

source: །ལུས་ཀྱི་རྣམ་འཕྲུལ་ཅི་ཕྱིར་སྟོན་མི་བྱེད།
en: Not demonstrate bodily magic?

source: །རྡོ་རྗེ་འཆང་བའི་གླང་བོ་ས་སྲུང་བུ།
en: “ ‘Erāvaṇa, that vajra-holding elephant

source: །དབང་པོའི་འཁོར་གྱུར་རྫུ་འཕྲུལ་ཆེན་པོ་དེ།
en: Who became a court member to Indra and possessed great magical power,

source: །མགོ་བོ་སུམ་ཅུ་རྩ་གསུམ་མངོན་སྤྲུལ་ཅིང་།
en: Magically projected thirty-three heads,

source: །མགོ་རྣམས་ཀུན་ལའང་མཆེ་བ་དྲུག་དྲུག་སྟེ།
en: And on each head six tusks per mouth.

source: །མཆེ་བ་དེ་དག་སོ་སོ་རེ་རེ་ལའང་།
en: “ ‘On each of those tusks

source: །རྫིང་བུ་ཆུས་གང་བདུན་བདུན་སྤྲུལ་པ་བྱེད།
en: He projected seven pools filled with water,

source: །རྫིང་རེ་ལ་ཡང་པད་མ་སྣ་ཚོགས་པ། །རྣམ་པར་བཀོད་པ་བདུན་བདུན་སྤྲུལ་པ་བྱེད།
en: And in each pool he projected decorations Of seven lotuses of various kinds.

source: །པད་མ་རེ་རེའང་ལྷ་ཡི་བུ་མོ་དག །སྒྱུ་རྩལ་ཀུན་ཤེས་བདུན་བདུན་སྤྲུལ་པ་བྱེད།
en: “ ‘Playing with each lotus Were seven divine maidens who were expert in all arts.

source: །དེ་དག་རྩེད་མོ་གླུ་གར་ཚུལ་ལ་མཁས། །སུམ་ཅུ་རྩ་གསུམ་དབང་པོ་དེ་དང་རྩེ།
en: They played with the lord of the thirty-three gods, Who was expert in song and dance.

source: །གླང་པོ་དེ་ཡང་ལུས་ནི་བསྒྱུར་བྱས་ཏེ།
en: “ ‘That elephant, magically transforming his body,

source: །ལྷ་རྣམས་ཀུན་དང་འགྲོགས་ཤིང་འདྲེ་བར་བྱེད།
en: Befriended and associated with all the gods.

source: །སྤྱོད་པའི་ཚུལ་དང་ལོངས་སྤྱོད་ཀུན་ཀྱང་འཐུན།
en: He brought his way of behavior and conduct into harmony with theirs.

source: །གླང་པོ་མཆོག་གི་རྣམ་འཕྲུལ་དེ་ལྟར་སྣང་།
en: So was the magic of the supreme elephant observed.

source: །གླང་པོ་ཆགས་སྡང་གཏི་མུག་ལྡན་དེ་ཡང་།
en: “ ‘If even that elephant who possessed attachment and confusion

source: །འདི་འདྲའི་རྫུ་འཕྲུལ་རབ་ཏུ་སྟོན་བྱེད་ན།
en: Could project such a magical projection,

source: །ཤེས་རབ་ཐབས་ཀྱི་སྟོབས་ལ་སྦྱངས་པ་རྣམས།
en: Why could those who have mastered discriminative wisdom

source: །ཏིང་འཛིན་བརྒྱ་ཡིས་རྣམ་འཕྲུལ་ཅིས་མི་བྱེད།
en: And the power of means not project magic using their hundred absorptions?

source: །སྒྲ་གཅན་ཇི་ལྟར་འདོད་བཞིན་ལུས་འཕྲུལ་ཏེ།
en: “ ‘The god Rāhu can magically create any bodies he likes.

source: །རྡོ་རྗེའི་གཞི་ལ་རྐང་པ་འཇོག་བྱེད་ཅིང་།
en: He projects them, one setting foot on the diamond lode on the ocean’s floor

source: །རྒྱ་མཚོ་ལྟེ་བར་ཕྱིན་པ་ཙམ་དུ་སྟོན།
en: And another journeying to the middle of the ocean.

source: །རི་རབ་རྩེ་དང་ཉིད་ཀྱི་མགོ་ཡང་སྙོམས།
en: He can make his head equal in height to the peak of Mount Sumeru.

source: །སྒྲ་གཅན་ཆགས་སྡང་གཏི་མུག་ལྡན་དེ་ཡང་།
en: “ ‘If even Rāhu, filled with attachment, hatred, and confusion,

source: །འཇིག་རྟེན་སྒྲོན་མ་བདུད་རྣམས་རབ་འཇོམས་པ།
en: Then why could the Lamp of the World who overcame Māra

source: །རྫུ་འཕྲུལ་མཐའ་ཡས་ཅི་ཕྱིར་སྟོན་མི་བྱེད།
en: Not project infinite magical forms?

source: །བརྒྱ་བྱིན་རྣམ་འཕྲུལ་བསམ་ཡས་རབ་སྣང་སྟེ།
en: “ ‘The inconceivable magic of Indra is conspicuous.

source: །ལྷ་དང་ལྷ་མིན་དབང་པོ་གཡུལ་འགྱེད་ཚེ།
en: When the gods and asura leaders went to war,

source: །ལྷ་མིན་བྱེ་བ་འཕྱེས་པ་ཇི་སྙེད་པ།
en: Ten million asuras fled, and to each of them

source: །དེ་སྙེད་བརྒྱ་བྱིན་རང་གི་ལུས་ལས་སྤྲུལ།
en: Indra projected himself from his own body.

source: །ལྷ་མིན་དབང་དང་ལྷ་མིན་ཕལ་ཀུན་གྱིས།
en: “ ‘The asura rulers and common ones

source: །བརྒྱ་བྱིན་རང་རང་མདུན་ན་འདུག་པར་ཤེས། །དེ་ནི་རྡོ་རྗེ་འཆང་བས་བཟུང་ངོ་ཞེས། །ལྷ་མིན་དབང་པོ་ཀུན་ཀྱང་མགོ་མྱོས་གྱུར།
en: All knew that they were in the presence of Indra, And the asura rulers went mad, crying: “I am caught by the vajra-wielder!”

source: །འཇིགས་པར་བྱེད་པའི་མིག་སྟོང་རབ་བསྟན་ཏེ།
en: “ ‘Having seen Indra, who had magically projected a fearsome thousand-eyed form,

source: །རྡོ་རྗེ་མེ་ལྕེ་འབར་བ་ཐོགས་བྱེད་ཅིང་།
en: Wielding a flaming vajra in his hand,

source: །ལུས་ལ་གོ་བགོས་གཟི་བརྗིད་བསྙེན་དཀའ་བའི།
en: His body clad in splendid, invincible armor,

source: །བརྒྱ་བྱིན་མཐོང་ནས་ལྷ་མིན་དབང་པོ་འབྱེར།
en: The asura rulers fled.

source: །དེ་ཡང་བསོད་ནམས་ཕལ་པའི་མཐུ་སྟོབས་ཀྱིས། །ལྷ་རྒྱལ་དོན་དུ་རྣམ་པར་འཕྲུལ་བྱེད་ན།
en: “ ‘If he could project such magical projections for the sake of the gods’ victory Through the power of ordinary merit,

source: །འགྲོ་བ་མ་ལུས་ཀུན་གྱི་སྐྱབས་གྱུར་པ།
en: Then why would those buddhas who are the refuge of all living beings without exception,

source: །བསོད་ནམས་མི་ཟད་རྣམས་ལྟ་ཅིས་མི་འཕྲུལ།
en: And who possess inexhaustible merit, not be able to project such bodies?

source: །ལྷ་ལ་སྐུལ་མ་འདེབས་པའི་ལྷ་ཡི་རྔ།
en: “ ‘A divine drum that encourages the gods,

source: །ལྷ་ལས་རྣམ་པར་སྨིན་པས་གྲུབ་གྱུར་པ།
en: Which was acquired through the fruition of the gods’ karmic deeds,

source: །ལྷ་རྣམས་བག་མེད་གནས་པར་ཤེས་གྱུར་ནས། །རྔ་དེ་ནམ་མཁའ་ལས་ནི་སྒྲ་སྒྲོགས་ཏེ།
en: Would resound loudly from the sky When it became aware that the gods were dwelling in carelessness, saying:

source: །འདོད་པ་ཐམས་ཅད་མི་རྟག་ཐེར་ཟུག་མིན།
en: “ ‘ “All desires are impermanent and not eternal.

source: །ཐ་ཤལ་མི་བརྟན་དབུ་བའི་ངོ་བོ་ཉིད།
en: They are base, uncertain, and of a bubble-like nature;

source: །སྒྱུ་མ་སྨིག་རྒྱུ་ཆུ་ཟླ་མཚུངས་ཤིང་འདྲ།
en: Like an illusion, mirage, or a moon reflected in water—

source: །སྲིད་པ་ཐམས་ཅད་རྨི་ལམ་སྤྲིན་དང་མཚུངས།
en: All of existence is like a cloud in a dream.

source: །བག་མེད་ཐམས་ཅད་དགྲར་བཅས་མྱ་ངན་ཅན།
en: “ ‘ “All carelessness is a hateful, pitiful thing.

source: །འཆི་བའི་ལམ་ཡིན་མི་འཆི་ལམ་མ་ཡིན།
en: It is the path of death, not the path of immortality.

source: །ཇི་སྙེད་སུ་དག་བག་མེད་གནས་གྱུར་པ།
en: All who live carelessly

source: །དེ་དག་འཆི་བདག་ཆུ་སྲིན་ཆེན་པོས་ཟིན།
en: Live caught in the mouth of the great crocodile of Yama.

source: །སྡུག་བསྔལ་རྩ་བ་ཡོངས་འཛིན་ཐམས་ཅད་ཡིན།
en: “ ‘ “Carelessness is the universal supporter of the root of suffering.

source: །སྐྱེ་བ་ཐམས་ཅད་འཕགས་པ་རྣམས་ཀྱིས་སྨད།
en: All rebirths are disparaged by the exalted ones.

source: །འདོད་པའི་ཡོན་ཏན་རྣམས་ཀྱི་ཡུལ་ལ་རྨོངས།
en: Careless ones are confused about the objects of the senses.

source: །ཆོས་ཀྱི་སྟོབས་ལ་རྟག་དགའ་གྱིས་ཞེས་བསྐུལ།
en: Always rejoice in the power of Dharma!”

source: །རྔ་དེས་བསྐུལ་ནས་བརྒྱ་བྱིན་ལྷ་རྣམས་དང་།
en: “ ‘Encouraged by the words of that drum, the gods of Indra

source: །ལྷ་ཡི་འདུན་ས་ཆོས་བཟང་འདུག་ནས་སུ།
en: Who dwelled in the divine assembly hall of Sudharmā

source: །གཏམ་གང་ཞི་ཞིང་འདོད་ཆགས་བྲལ་འཐུན་པ།
en: Spoke words that were as peaceful as possible and free of passion,

source: །ཆོས་ཀྱི་གཏམ་དེ་ལྷ་རྣམས་ཀུན་ལ་བརྗོད།
en: And the drum would utter that Dharma talk to all the gods.

source: །རྔ་དེ་གཟུགས་མེད་བསྟན་དུ་མི་རུང་ཡང་།
en: “ ‘Although that drum could not teach in the formless realm,

source: །དེ་ལྟར་རྔ་སྒྲས་དོན་ཆེན་རབ་བྱེད་ན།
en: If its drum sound could thus achieve such a great purpose,

source: །བསམ་པ་ཇི་བཞིན་གཟུགས་ནི་ཡོངས་སྟོན་རྣམས།
en: Then why could those living buddhas who completely reveal their bodies

source: །འགྲོ་བ་ཀུན་གྱི་དོན་ཆེན་ཅིས་མི་བྱེད།
en: Not achieve a great purpose for all living beings?

source: །ལྷ་ཡི་བསོད་ནམས་ཁྱད་པར་མཐུ་སྟོབས་ཀྱིས། །ལྷ་ལ་སྐུལ་མ་འདེབས་པའི་རྔ་ཡི་སྒྲ།
en: The sound of a drum that encouraged the gods Resounded through the power of the special merit of the gods, saying:

source: །ལྷ་རྣམས་མ་འཇིགས་ཤིག་ཅེས་སྒྲ་འབྱིན་ཏེ།
en: “Gods, be fearless!”

source: །རྔ་ཡིས་བསྐུལ་ནས་ལྷ་རྣམས་རབ་དགའ་ཞིང་།
en: “ ‘Urged on by that drum, the gods rejoiced,

source: །སྐྲག་པ་མེད་དེ་སྟོབས་ཀྱང་སྐྱེས་པར་གྱུར།
en: And, freed from fear, they were revitalized.

source: །ལྷ་མིན་དབང་པོ་སྐྲག་པས་ཉེན་པ་རྣམས།
en: Then, the asura kings plagued by fear

source: །འཇིགས་ནས་དམག་བཅས་དེ་ཡི་མོད་ལ་འབྱེར།
en: Turned in fright at that very moment and fled.

source: །དེ་ལྟར་སྒྲ་སྐད་འབྱིན་པའི་རྔ་འདྲ་བ།
en: “ ‘Similarly, like the drum emitting speech,

source: །འགྲོ་བ་ཀུན་གྱི་སྐྱབས་དང་དཔུང་གཉེན་པོ། །ཉོན་མོངས་བདུད་བཅོམ་སྙིང་རྗེ་ཆེ་ལྡན་རྣམས།
en: Those compassionate ones who have overcome the defilements and māras, Those refuges of all beings and comrades-in-arms,

source: །ཞི་བའི་སྒྲ་བསྒྲགས་ཉོན་མོངས་སེལ་བར་བྱེད།
en: Remove defilements through their peaceful sounds.

source: །དབང་པོའི་ལྷ་ཡི་བུ་མོ་དགུ་བཅུ་གཉིས།
en: “ ‘Through Indra’s magical projection, his ninety-two divine maidens

source: །དབང་པོའི་སྤྲུལ་པས་ཀུན་ཀྱང་དགའ་བར་འགྱུར།
en: Give pleasure to all the other gods who are present.

source: །གཅིག་ཀྱང་བདག་དང་བརྒྱ་བྱིན་རྩེ་བར་ཤེས།
en: Each one knows how to play with each deity and with Indra,

source: །གཅིག་ལྟར་ལྷ་མོ་ཀུན་ཀྱང་དེ་བཞིན་ནོ།
en: And all the goddesses do the same.

source: །ལྷ་མོ་ཀུན་དང་དཀའ་བར་གནས་སྣང་ཡང་།
en: “ ‘Even though the goddesses appear to stay, pleasing all the other gods,

source: །ཆོས་བཟང་འདུན་ས་ན་ཡང་དེ་བཞིན་འདུག །ལྷ་རྣམས་ཀུན་ལ་ཆོས་རབ་སྟོན་སྣང་ཞིང་།
en: In the assembly hall of Sudharmā, they dwell in the same way— There they teach Dharma clearly to all the gods.

source: །བརྒྱ་བྱིན་སྐད་ཅིག་གཅིག་ལ་རྣམ་པར་འཕྲུལ།
en: That is projected by Indra in a single moment.

source: །བརྒྱ་བྱིན་ཆགས་སྡང་གཏི་མུག་ལྡན་པ་ཡང་།
en: “ ‘If even Indra with his desire, hate, and confusion

source: །སྤྲུལ་པས་རང་གི་འཁོར་རྣམས་དགའ་བྱེད་ན།
en: Pleases those in his entourage through magical projections,

source: །འགྲོ་དོན་མི་སྐྱོ་སྦྱོར་རྣམས་ཅི་ཡི་ཕྱིར།
en: Why would those who tirelessly apply themselves for the welfare of living beings

source: །རྫུ་འཕྲུལ་སྟོབས་ཀྱིས་འཇིག་རྟེན་མགུ་མི་བྱེད།
en: Not please the world by virtue of magical projections?

source: །བདུད་ཀྱི་དཀྲུགས་མ་འགྲོ་བའི་དབང་སྒྱུར་བ།
en: “ ‘Kālī of the māra deities, ruler of living beings,

source: །དེ་ཡི་དབང་དུ་སེམས་ཅན་འདི་ཀུན་འདོད།
en: Brings all these sentient beings under her power.

source: །ལས་དང་ཉོན་མོངས་ཀུན་དུ་ཞུགས་པ་ཡིས།
en: Through the workings of karma and the defilements,

source: །སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་བདུད་དེས་བཅིངས།
en: All ordinary beings are caught by that māra.

source: །ཆགས་སྡང་གཏི་མུག་ལྡན་པའི་བདུད་དེ་ཡང་།
en: “ ‘If even that māra who is ridden with desire, hate, and confusion

source: །འགྲོ་བ་ཐམས་ཅད་དབང་དུ་འགྱུར་བྱེད་ན།
en: Can overpower all living beings,

source: །དབང་བཅུ་དབང་ཐོབ་རྣམས་ལྟ་ཅི་སྨོས་ཏེ།
en: It goes without saying that those who have attained the might of the ten powers could,

source: །འགྲོ་བ་ཐམས་ཅད་རང་གི་ཕྱོགས་མི་འཇོག
en: And all living creatures do not dispute it.

source: །སྟོང་གསུམ་གནས་ཀྱི་བདག་པོ་ཚངས་པ་ཡང་།
en: “ ‘Brahmā, lord of the three-thousand Brahmā realms,

source: །སྟོང་གསུམ་ཚངས་གནས་ཇི་སྙེད་ཡོད་པ་ན།
en: Also clearly illuminates all deities dwelling

source: །དེ་དག་ཀུན་ན་འདུག་པར་རབ་སྣང་ཞིང་།
en: Within the three-thousand Brahmā realms

source: །ཚངས་པའི་སྒྲ་དབྱངས་ཤིན་ཏུ་ཡིད་འོང་སྒྲོགས།
en: And sounds forth his very pleasant Brahmā voice.

source: །ཚངས་དེ་འཇིག་རྟེན་པ་ཡི་ཚངས་ལམ་གྱི། །བསམ་གཏན་མངོན་ཤེས་རྣམ་པར་འཕྲུལ་བྱེད་ན། །འཇིག་རྟེན་རབ་འདས་བླ་ན་མེད་པ་ཡི། །བསམ་གཏན་རྣམ་ཐར་གནས་པ་ཅིས་མི་འཕྲུལ།
en: “ ‘If that god Brahmā can project magical projections With the concentrations and emancipations of the Brahmā path of the world, Then why could those who dwell in the insuperable concentrations and emancipations that have Transcended the world not also make magical projections?

source: །དབང་ཕྱུག་ཆེན་པོའི་ཤེས་པའི་རྣམ་འཕྲུལ་ལྟོས།
en: “ ‘Look at the magical mental projection of Maheśvara.

source: །རྒྱ་མཚོའི་སྤྲིན་གྱིས་ཆར་ཐིགས་རབ་བཀྱེ་བ།
en: Emanating rain drops wrought from clouds of the ocean,

source: །སྐད་ཅིག་གཅིག་ལ་ཐམས་ཅད་འགྲང་བ་བྱེད། །ཐིགས་འགའི་ཟེར་ཀྱང་མ་ཤེས་དེ་མེད་ན།
en: He counted them all in a single moment, Not overlooking the appearance of even a few of the drops.

source: །བསླབ་པ་བསྐལ་པ་བསམ་ཡས་རབ་བསླབས་ཏེ། །བྱང་ཆུབ་བླ་མེད་ཡེ་ཤེས་ཐོབ་པ་རྣམས། །ཅི་ཕྱིར་སྐད་ཅིག་གཅིག་ལ་སེམས་ཀྱིས་ནི། །འགྲོ་བ་མ་ལུས་ཀུན་གྱི་སེམས་མི་ཤེས།
en: “ ‘That being so, why would they who have attained the gnosis Of the highest awakening by practicing discipline for incalculable eons Not be mentally able to know the minds Of all living beings without exception?

source: །སེམས་ཅན་ལས་སྨིན་བསམ་གྱིས་མི་ཁྱབ་པས།
en: “ ‘Through the inconceivable karmic fruition of sentient beings

source: །འཇིག་རྟེན་འདི་ཀུན་རླུང་ལས་ཡོངས་སུ་བྱུང་།
en: This entire world originated from air.

source: །རྒྱ་མཚོ་རི་དང་ལྷ་ཡི་གཞལ་མེད་ཁང་།
en: Its oceans, mountains, divine palaces,

source: །རིན་ཆེན་རྣམ་ཕྱེ་ས་བོན་བཀྲམ་པའང་བྱུང་།
en: Unearthed jewels, and scattered seeds have all arisen from air.

source: །རླུང་ལས་སྤྲིན་བྱུང་ཆར་པའང་ཀུན་དུ་འབབ།
en: “ ‘From air clouds have formed and rain has poured.

source: །རླུང་གིས་སྤྲིན་ཀྱང་རབ་ཏུ་ཞི་བར་བྱེད།
en: Yet air also makes the clouds subside.

source: །འཇིག་རྟེན་ལོ་ཏོག་འཕེལ་བའང་རླུང་བྱེད་དེ།
en: Air also increases harvests in the world;

source: །རླུང་ནི་འགྲོ་བ་ཀུན་ལ་ཕན་པ་སྐྱེད།
en: Air produces benefits for all living beings.

source: །རླུང་དེ་ཕ་རོལ་ཕྱིན་ལ་མ་བསླབས་ཤིང་།
en: “ ‘Even though that air never studied the perfections

source: །སངས་རྒྱས་ཡོན་ཏན་རྣམས་ལ་མ་བསླབས་ཀྱང་།
en: Or learned the Buddha’s teachings,

source: །འཇིག་རྟེན་རྣམ་སྨིན་བསམ་ཡས་སྟོན་བྱེད་ན།
en: If it can yield the inconceivable ripening of the world,

source: །དམ་པ་ཐོབ་རྣམས་ཅི་ཕྱིར་སྟོན་མི་བྱེད།
en: Why could those who have attained the supreme not do that?

source: །རྒྱ་མཚོའི་འབྲུག་སྒྲའི་སྤྲིན་གྱི་ཆུ་ཚོགས་ནི།
en: “ ‘The waters in the thundering clouds of the ocean Reverberate with sounds pleasing to all sentient beings,

source: །བྱ་སྐད་རི་དགས་སྐད་དང་སྐྱེས་པ་དང་། །བུད་མེད་བུ་མོ་ཁྱེའུ་སྐད་ཅི་སྙེད་པ།
en: All bird songs, animal cries, and the voices of men, Women, girls, and boys.

source: །ཀུན་གྱི་སྒྲ་སྙན་སེམས་ཅན་རྣམས་ལ་སྒྲོགས།
en: “ ‘Having thus gained unobscured eloquence

source: །དེ་ལྟར་སྒྲ་སྙན་རང་བཞིན་མེད་ཤེས་ནས།
en: After understanding that the pleasant sound has no nature,

source: །འགྲོ་བ་ཀུན་ལ་སྒྲ་སྙན་བརྗོད་བྱས་ནས།
en: By speaking pleasant sounds to all living beings,

source: །ཡིད་འོང་སྒྲ་ཡིས་འཇིག་རྟེན་མགུ་བར་བྱེད།
en: One pleases the world through pleasant sounds.

source: །རྒྱ་མཚོ་འདི་ལ་ངོ་མཚར་རྨད་ཀྱི་ཆོས།
en: “ ‘This ocean is a wondrous phenomenon:

source: །འགྲོ་ཀུན་རྒྱ་དང་མཚུངས་པས་རྒྱ་མཚོ་སྟེ།
en: Since it is as vast as the universe, it is called vast lake.

source: །ཆུ་དང་འབྱུང་པོ་རིན་ཆེན་ཡོང་མི་ཟད།
en: Water and precious elements come from it without ever being exhausted;

source: །ཆུ་རྣམས་བཟུང་པས་ངོམས་པར་འགྱུར་བ་མེད།
en: One never grows tired of apprehending these waters.

source: །དེ་བཞིན་དེ་དག་འགྲོ་ཀུན་རྒྱ་འདྲ་སྟེ།
en: “ ‘In the same way these beings are as vast as the universe:

source: །བསོད་ནམས་བསམ་གཏན་རྣམ་པར་ཐར་རྣམས་དང་། །ཤེས་རབ་ཡེ་ཤེས་ཡོན་ཏན་ཀུན་མི་ཟད། །བསོད་ནམས་ཡོན་ཏན་སོགས་པས་ངོམས་པ་མེད། །
en: All their qualities of merit, concentrations, emancipations, And discriminative wisdom and gnosis are never exhausted—And one never tires of such merit and qualities and the like.

source: རྒྱ་མཚོའི་ཀླུ་ནི་རྣམ་པར་རྩེ་བ་ན། །ས་ཡི་གཞི་ནས་དབང་སྒྱུར་གནས་ཀྱི་བར། །གླིང་བཞི་བཅས་པར་སྤྲིན་ཆེན་རྒྱས་འགེངས་ཏེ། །དེ་དག་ཀུན་ཀྱང་སྣ་ཚོགས་བཀོད་པ་མང་། །
en: “ ‘When the nāgas of the ocean play, Immense clouds spread everywhere, All of them displaying sundry variations, From the base of the earth up to the realm of the Vaśavartin gods, Including the four continents of this world.

source: དེ་ནི་དབང་སྒྱུར་གནས་སུ་འཛམ་གླིང་གི། །གསེར་གྱི་མདོག་གི་སྤྲིན་རྣམས་རྣམ་པར་སྒྲུབ། །
en: “ ‘The nāgas cause those clouds. In the realm of the Vaśavartin gods, they take on golden hues.

source: འཕྲུལ་དགར་མུ་ཏིག་དམར་པོའི་མདོག་ལྟ་བུ།
en: In the realm of the Nirmāṇarati gods, they are colored like red pearls.

source: །དགའ་ལྡན་གནས་སུ་ཁ་བ་བ་མོའི་མདོག །
en: In the realm of the Tuṣita gods, they are the white color of the snow cow.

source: འཐབ་བྲལ་གནས་སུ་མཐོན་མཐིང་བཻ་དཱུརྱ།
en: “ ‘In the realm of the gods of the Yāma class, they are the color of deep blue vaiḍūrya gems.

source: །སུམ་ཅུ་རྩ་གསུམ་རྡོ་ཡི་སྙིང་པོ་འདྲ།
en: Among gods of the Trāyastriṃśa class, they are the color of aśmagarbha emeralds.

source: །སྐྱོང་བའི་གནས་སུ་ཤེལ་གྱི་མདོག་ལྟ་བུ།
en: In the realm of the gods of the protector class, they are the color of crystal.

source: །རྒྱ་མཚོར་རྡོ་རྗེ་མི་ཕྱེད་མཁྲེགས་འདྲ་བ།
en: In the ocean, they are like hard, unbreakable diamonds.

source: །མི་ཅི་གནས་སུ་སྤོས་མཆོག་འཁྲིགས་ལྟ་བུ།
en: “ ‘In the realm of kinnaras, they are like dense clouds of incense.

source: །ཀླུ་ཡི་གནས་སུ་པད་མའི་མདོག་འདྲ་བ།
en: In the realm of nāgas, they are colored like lotuses.

source: །གསང་བའི་གནས་སུ་ངང་པ་བྱ་གར་མདོག
en: In the secret realm of the gandharvas, they are colored like heron or geese.

source: །ལྷ་མིན་གནས་སུ་རི་བྲག་མདོག་འདྲ་བ།
en: In the realm of asuras, they are colored like mountain rocks.

source: །བྱང་དུ་གསེར་གྱི་འོད་ཟེར་མདོག་སྟོན་ཏེ།
en: “ ‘They project golden light rays in the northern continent,

source: །གླིང་རྣམས་གཞན་དུ་སྣ་ཚོགས་བཀོད་པ་སྟོན།
en: While in the other continents they project myriad arrays.

source: །འཛམ་བུའི་གླིང་དུ་རི་སྔོན་འདྲ་བ་སྟེ།
en: In this world of Jambudvīpa, they are like blue mountains.

source: །གང་ན་ཅི་མཐོ་སྤྲིན་རྣམས་དེ་བཞིན་ནོ།
en: Where clouds are higher, their colors change accordingly.

source: །དབང་སྒྱུར་གནས་སུ་གསེར་སྤྲིན་ངེས་བསྟན་ནས། །ཉི་མའི་མདོག་འདྲ་གློག་ཀྱང་རབ་ཏུ་འགྱེད།
en: “ ‘Having projected golden clouds in the realm of Vaśavartin gods, The nāgas cause lightning that is colored like the light of the sun to strike.

source: །འཕྲུལ་དགའི་གནས་སུ་ཟླ་འོད་བཟང་འདྲ་དང་། །
en: In the realm of the Nirmāṇarati gods, the lightning appears like excellent moonlight.

source: དགའ་ལྡན་གནས་སུ་འཛམ་བུའི་གསེར་མདོག་འདྲ།
en: In the realm of the Tuṣita gods, it is like the gold of the Jambu River.

source: །འཐབ་བྲལ་གནས་སུ་ཁ་བ་བ་མོའི་མདོག །
en: “ ‘In the realm of the gods of the Yāma class, the lightning is the color of frost.

source: སུམ་ཅུ་རྩ་གསུམ་གསེར་གྱི་འོད་ཟེར་འདྲ།
en: Among the gods of the Trāyastriṃśa class, it is like golden light rays.

source: །སྐྱོང་བའི་གནས་སུ་དཔལ་གྱི་སྙིང་པོའི་མདོག །
en: In the realm of the gods of the protector class, it has the color of a śrīgarbha jewel.

source: རྒྱ་མཚོར་མུ་ཏིག་དམར་པོའི་མདོག་འདྲ་བཀོད།
en: In the ocean it displays a color resembling red pearls.

source: །མི་ཅི་གནས་སུ་མཐོན་མཐིང་བཻ་དཱུརྱ།
en: “ ‘In the realm of kinnaras, it has the color of deep blue vaiḍūrya gems.

source: །ཀླུ་ཡི་གནས་སུ་དཔལ་གྱི་སྙིང་པོའི་མདོག
en: In the realm of nāgas, it is the color of the śrīgarbha jewel.

source: །གསང་བའི་གནས་སུ་ཤེལ་གྱི་མདོག་འདྲ་བ།
en: In the secret realm of the gandharvas, it is the color of crystal.

source: །ལྷ་མིན་གནས་སུ་རྡོ་ཡི་སྙིང་པོ་འདྲ།
en: In the realm of asuras, it has the color of aśmagarbha emeralds.

source: །བྱང་དུ་ནོར་བུ་སྐར་མདོག་ཁ་དོག་འདྲ།
en: “ ‘In the north, lightning strikes with a color like starlight.

source: །གླིང་གཞན་རྣམས་སུའང་བཀོད་པ་གཞན་དང་གཞན།
en: Each of the other continents features its own displays.

source: །འཛམ་བུའི་གླིང་དུ་ཟླ་བའི་ནོར་བུ་འབར།
en: In this world of Jambudvīpa, a jewel of the moon blazes forth,

source: །སྤྲིན་གྱི་མཚན་ཉིད་འཐུན་པའི་གློག་ཀྱང་འགྱེད།
en: And lightning also emerges in accordance with the clouds’ qualities.

source: །དེ་ནི་དབང་སྒྱུར་གནས་སུ་ཚངས་སྒྲ་སྒྲོགས།
en: “ ‘In the realm of Vaśavartin gods, the thunder is the voice of Brahmā.

source: །འཕྲུལ་དགའ་གནས་སུ་རྔ་སྒྲ་སྒྲོག་པར་བྱེད།
en: In the realm of the Nirmāṇarati gods, the beating of a drum is heard.

source: །དགའ་ལྡན་གནས་སུ་སིལ་སྙན་རོལ་མོའི་སྒྲ།
en: In the realm of the Tuṣita gods, thunder sounds like the music of cymbals.

source: །འཐབ་བྲལ་གནས་སུ་ལྷ་ཡི་བུ་མོའི་སྒྲ།
en: In the realm of the gods of the Yāma class, thunder is like the sound of the gods’ maidens speaking.

source: །སུམ་ཅུ་གསུམ་དུ་མི་ཅི་མང་པོའི་སྐད།
en: “ ‘Among the gods of the Trāyastriṃśa class, thunder sounds like the voices of kinnaras.

source: །སྐྱོང་བའི་གནས་སུ་དྲི་ཟའི་སྐད་དུ་སྟེ།
en: In the realm of the gods of the protector class, it is like the voices of gandharvas.

source: །རྒྱ་མཚོར་རི་འཐབ་སྒྲ་སྐད་འདྲ་བའོ།
en: In the ocean it is like the sound of rumbling mountains.

source: །མི་ཅི་གནས་སུ་གླིང་བུ་ཀུ་ནལ་སྒྲ།
en: In the realm of kinnaras, it is the sound of a kunal flute.

source: །ཀླུ་ཡི་གནས་སུ་ཀ་ལ་པིང་ཀའི་སྒྲ།
en: “ ‘In the realm of nāgas, it is the voice of a kalaviṅka bird.

source: །གསང་བའི་གནས་སུ་ཀླུ་ཡི་བུ་མོའི་སྒྲ།
en: In the secret realm of the gandharvas, it is the voice of a nāga maiden.

source: །ལྷ་མིན་གནས་སུ་ལྷ་ཡི་རྫ་རྔའི་སྒྲ།
en: In the realm of asuras, it is the sound of a divine clay-pot drum.

source: །མི་ཡི་གནས་སུ་རྒྱ་མཚོ་གླིང་བུའི་སྒྲ།
en: In the realm of humans, it resembles the sound of an ocean flute.

source: །དེ་ནི་དབང་སྒྱུར་གནས་སུ་ལྷ་སྤོས་ཞིམ།
en: “ ‘In the realm of Vaśavartin gods, divine fragrance smells sweet,

source: །མེ་ཏོག་སྣ་ཚོགས་བཀོད་པའི་ཆར་ཡང་འབེབས།
en: And showers in the form of various flowers rain down.
